---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.Alignment.Description
source: html/ec09b352-81e0-1f16-85d6-1d4316e8dbeb.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.Description Property

The Description of this alignment.

## Syntax (C#)
```csharp
public string Description { get; }
```